/*
 * Copyright (C) 2019 MediaTek Inc.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See http://www.gnu.org/licenses/gpl-2.0.html for more details.
 */


#include <linux/kernel.h>
#include <linux/delay.h>
#include <linux/mutex.h>
#include <sound/pcm_params.h>
#include "mt8518-asrc-clk.h"
#include <linux/of_address.h>
#include <linux/of.h>
#include <linux/of_irq.h>
#include <linux/device.h>
#include <linux/of_platform.h>

#include "mt8518-asrc-hw.h"
#include "mt8518-asrc-reg.h"

static const u32  PeriodModeVal_Dm48[FS_NUM] = {
	0x60000, 0x40000, 0x30000, 0x20000, 0x18000, 0x10000, 0x8000, 0x4000,
	0x2000, 0, 0, 0, 0, 0, 0, 0, 0x687d6, 0x45A8F, 0x343EB, 0x22D47,
	0x1A1F6, 0x116A4, 0x8B52, 0x45A9, 0x22D4
};

static const u32  FreqModeVal[FS_NUM] = {
	0x50000, 0x78000, 0xA0000, 0xF0000, 0x140000, 0x1E0000, 0x3C0000,
	0x780000, 0xF00000, 0, 0, 0, 0, 0, 0, 0, 0x49800, 0x6E400, 0x93000,
	0xDC800, 0x126000, 0x1B9000, 0x372000, 0x6E4000, 0xDC8000
};

static inline void afe_set_bit(u32 addr, int bit)
{
	afe_msk_write(addr,
	      (u32)(0x1U) << (u32)bit, (u32)(0x1U) << (u32)bit);
}

static inline void afe_clear_bit(u32 addr, int bit)
{

	0x09e74455, 0xeddfc92a, 0x09e74455, 0x3adfddda, 0xe28c4ae3, 0x00000002,
	0x078ea9ae, 0xf28c3ba7, 0x078ea9ae, 0x3a0a98e8, 0xe3d93541, 0x00000002,
	0x09b32647, 0xefe954c5, 0x09b32647, 0x3910a244, 0xe564f781, 0x00000002,
	0x04f0e9e4, 0xf9b7e8d5, 0x04f0e9e4, 0x381f6928, 0xe6e5316c, 0x00000002,
	0x006303ee, 0x003ae836, 0x006303ee, 0x37852c0e, 0xe7db78c1, 0x00000002,
	0x06337ac0, 0xf46665c5, 0x06337ac0, 0x3c818406, 0xe042df81, 0x00000002
	};

	static const u32 IIR_COEF_352_TO_32[TBL_SZ_MEMASRC_IIR_COEF] = {
	0x07d25973, 0xf0fd68ae, 0x07d25973, 0x3dd9d640, 0xe02aaf11, 0x00000002,
	0x05a0521d, 0xf5390cc4, 0x05a0521d, 0x1ec7dff7, 0xf044be0d, 0x00000003,
	0x04a961e1, 0xf71c730b, 0x04a961e1, 0x1e9edeee, 0xf082b378, 0x00000003,
	0x06974728, 0xf38e3bf1, 0x06974728, 0x3cd69b60, 0xe1afd01c, 0x00000002,
	0x072d4553, 0xf2c1e0e2, 0x072d4553, 0x3c54fdc3, 0xe28e96b6, 0x00000002,
	0x02802de3, 0xfbb07dd5, 0x02802de3, 0x3bc4f40f, 0xe38a3256, 0x00000002,
	0x000ce31b, 0xfff0d7a8, 0x000ce31b, 0x3b4bbb40, 0xe45f55d6, 0x00000002,
	0x00000000, 0x1ea1b887, 0x1ea1b887, 0x03b1b27d, 0x00000000, 0x00000005
	};

	static const u32 IIR_COEF_384_TO_32[TBL_SZ_MEMASRC_IIR_COEF] = {
	0x0c5074a7, 0xe83ee090, 0x0c5074a7, 0x1edf8fe7, 0xf04ec5d0, 0x00000003,
	0x05bbb01f, 0xf4fa20a7, 0x05bbb01f, 0x1ea87e16, 0xf093b881, 0x00000003,
	0x04e8e57f, 0xf69fc31d, 0x04e8e57f, 0x1e614210, 0xf0f1139e, 0x00000003,
	0x07756686, 0xf1f67c0b, 0x07756686, 0x3c0a3b55, 0xe2d8c5a6, 0x00000002,
	0x097212e8, 0xeede0608, 0x097212e8, 0x3b305555, 0xe3ff02e3, 0x00000002,
	0x0495d6c0, 0xf8bf1399, 0x0495d6c0, 0x3a5c93a1, 0xe51e0d14, 0x00000002,
	0x00458b2d, 0xfffdc761, 0x00458b2d, 0x39d4793b, 0xe5d6d407, 0x00000002,
	0x0609587b, 0xf456ed0f, 0x0609587b, 0x3e1d20e1, 0xe0315c96, 0x00000002
	};

	static const u32 IIR_COEF_352_TO_24[TBL_SZ_MEMASRC_IIR_COEF] = {
	0x062002ee, 0xf4075ac9, 0x062002ee, 0x1f577599, 0xf0166280, 0x00000003,
	0x05cdb68c, 0xf4ab2e81, 0x05cdb68c, 0x1f2a7a17, 0xf0484eb7, 0x00000003,
	0x04e3078b, 0xf67b954a, 0x04e3078b, 0x1ef25b71, 0xf08a5bcf, 0x00000003,
	0x071fc81e, 0xf23391f6, 0x071fc81e, 0x3d4bc51b, 0xe1cdf67e, 0x00000002,
	0x08359c1c, 0xf04d3910, 0x08359c1c, 0x3c80bf1e, 0xe2c6cf99, 0x00000002,
	0x0331888d, 0xfa1ebde6, 0x0331888d, 0x3b94c153, 0xe3e96fad, 0x00000002,
	0x00143063, 0xffe1d1af, 0x00143063, 0x3ac672e3, 0xe4e7f96f, 0x00000002,
	0x00000000, 0x2d7cf831, 0x2d7cf831, 0x074e3a4f, 0x00000000, 0x00000004
	};

	static const u32 IIR_COEF_384_TO_24[TBL_SZ_MEMASRC_IIR_COEF] = {
	0x0c513993, 0xe7dbde26, 0x0c513993, 0x1f4e3b98, 0xf03b6bee, 0x00000003,
	0x05bd9980, 0xf4c4fb19, 0x05bd9980, 0x1f21aa2b, 0xf06fa0e5, 0x00000003,
	0x04eb9c21, 0xf6692328, 0x04eb9c21, 0x1ee6fb2f, 0xf0b6982c, 0x00000003,
	0x07795c9e, 0xf18d56cf, 0x07795c9e, 0x3d345c1a, 0xe229a2a1, 0x00000002,
	0x096d3d11, 0xee265518, 0x096d3d11, 0x3c7d096a, 0xe30bee74, 0x00000002,
	0x0478f0db, 0xf8270d5a, 0x0478f0db, 0x3bc96998, 0xe3ea3cf8, 0x00000002,
	0x0037d4b8, 0xffdedcf0, 0x0037d4b8, 0x3b553ec9, 0xe47a2910, 0x00000002,
	0x0607e296, 0xf42bc1d7, 0x0607e296, 0x3ee67cb9, 0xe0252e31, 0x00000002
	};

	static const struct {
		const u32 *coef;
		size_t cnt;
	} iir_coef_tbl_list[23] = {
		{ IIR_COEF_384_TO_352, ARRAY_SIZE(IIR_COEF_384_TO_352) },/* 0 */
		{ IIR_COEF_256_TO_192, ARRAY_SIZE(IIR_COEF_256_TO_192) },/* 1 */
		{ IIR_COEF_352_TO_256, ARRAY_SIZE(IIR_COEF_352_TO_256) },/* 2 */
		{ IIR_COEF_384_TO_256, ARRAY_SIZE(IIR_COEF_384_TO_256) },/* 3 */
		{ IIR_COEF_352_TO_192, ARRAY_SIZE(IIR_COEF_352_TO_192) },/* 4 */
		{ IIR_COEF_384_TO_192, ARRAY_SIZE(IIR_COEF_384_TO_192) },/* 5 */
		{ IIR_COEF_384_TO_176, ARRAY_SIZE(IIR_COEF_384_TO_176) },/* 6 */
		{ IIR_COEF_256_TO_96, ARRAY_SIZE(IIR_COEF_256_TO_96) },/* 7 */
		{ IIR_COEF_352_TO_128, ARRAY_SIZE(IIR_COEF_352_TO_128) },/* 8 */
		{ IIR_COEF_384_TO_128, ARRAY_SIZE(IIR_COEF_384_TO_128) },/* 9 */
		{ IIR_COEF_352_TO_96, ARRAY_SIZE(IIR_COEF_352_TO_96) },/* 10 */
		{ IIR_COEF_384_TO_96, ARRAY_SIZE(IIR_COEF_384_TO_96) },/* 11 */
		{ IIR_COEF_384_TO_88, ARRAY_SIZE(IIR_COEF_384_TO_88) },/* 12 */
		{ IIR_COEF_256_TO_48, ARRAY_SIZE(IIR_COEF_256_TO_48) },/* 13 */
		{ IIR_COEF_352_TO_64, ARRAY_SIZE(IIR_COEF_352_TO_64) },/* 14 */
		{ IIR_COEF_384_TO_64, ARRAY_SIZE(IIR_COEF_384_TO_64) },/* 15 */
		{ IIR_COEF_352_TO_48, ARRAY_SIZE(IIR_COEF_352_TO_48) },/* 16 */
		{ IIR_COEF_384_TO_48, ARRAY_SIZE(IIR_COEF_384_TO_48) },/* 17 */
		{ IIR_COEF_384_TO_44, ARRAY_SIZE(IIR_COEF_384_TO_44) },/* 18 */
		{ IIR_COEF_352_TO_32, ARRAY_SIZE(IIR_COEF_352_TO_32) },/* 19 */
		{ IIR_COEF_384_TO_32, ARRAY_SIZE(IIR_COEF_384_TO_32) },/* 20 */
		{ IIR_COEF_352_TO_24, ARRAY_SIZE(IIR_COEF_352_TO_24) },/* 21 */
		{ IIR_COEF_384_TO_24, ARRAY_SIZE(IIR_COEF_384_TO_24) },/* 22 */
	};

	static const u32 freq_new_index[FS_NUM] = {
		0, 1, 2, 3, 4, 5, 6, 7,
		8, 99, 99, 99, 99, 99, 99, 99,
		9, 10, 11, 12, 13, 14, 15, 16,
		17
	};

	static const u32 iir_coef_tbl_matrix[18][18] = {
		{
			NO_NEED, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED, NO_NEED, 0, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED, NO_NEED
		},
		{
			3, NO_NEED, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED, INV_COEF, 0, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED
		},
		{
			5, 1, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED, 6, INV_COEF, 0,
			NO_NEED, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED
		},
		{
			9, 5, 3, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED, NO_NEED, INV_COEF, 6, INV_COEF, 0,
			NO_NEED, NO_NEED, NO_NEED, NO_NEED, NO_NEED
		},
		{
			11, 7, 5, 1, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED, 12, INV_COEF, 6, INV_COEF, 0, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED
		},
		{
			15, 11, 9, 5, 3, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			INV_COEF, 12, INV_COEF, 6, INV_COEF, 0, NO_NEED,
			NO_NEED, NO_NEED
		},
		{
			20, 17, 15, 11, 9, 5, NO_NEED, NO_NEED, NO_NEED,
			INV_COEF, 18, INV_COEF, 12, INV_COEF, 6, 0, NO_NEED,
			NO_NEED
		},
		{
			RATIOVER, 22, 20, 17, 15, 11, 5, NO_NEED, NO_NEED,
			RATIOVER, RATIOVER, INV_COEF, 18, INV_COEF, 12,
			6, 0, NO_NEED
		},
		{
			RATIOVER, RATIOVER, RATIOVER, 22, 20, 17, 11, 5,
			NO_NEED, RATIOVER, RATIOVER, RATIOVER,
			RATIOVER, INV_COEF, 18, 12, 6, 0
		},
		{
			NO_NEED, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED
		},
		{
			2, NO_NEED, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED, 3, NO_NEED, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED
		},
		{
			4, INV_COEF, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED, 5, 1, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED
		},
		{
			8, 4, 2, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			NO_NEED, NO_NEED, 9, 5, 3, NO_NEED, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED, NO_NEED
		},
		{
			10, INV_COEF, 4, INV_COEF, NO_NEED, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED, 11, 7, 5, 1, NO_NEED,
			NO_NEED, NO_NEED, NO_NEED, NO_NEED
		},
		{
			14, 10, 8, 4, 2, NO_NEED, NO_NEED, NO_NEED, NO_NEED,
			15, 11, 9, 5, 3, NO_NEED, NO_NEED, NO_NEED, NO_NEED
		},
		{
			19, 16, 14, 10, 8, 4, NO_NEED, NO_NEED, NO_NEED, 20,
			17, 15, 11, 9, 5, NO_NEED, NO_NEED, NO_NEED
		},
		{
			RATIOVER, 21, 19, 16, 14, 10, 4, NO_NEED, NO_NEED,
			RATIOVER, 22, 20, 17, 15, 11, 5, NO_NEED, NO_NEED
		},
		{
			RATIOVER, RATIOVER, RATIOVER, 21, 19, 16, 10, 4,
			NO_NEED, RATIOVER, RATIOVER, RATIOVER, 22, 20,
			17, 11, 5, NO_NEED
		}
	};

	const u32 *coef = NULL;
	size_t cnt = 0;
	u32 i = freq_new_index[input_fs];
	u32 j = freq_new_index[output_fs];

	if (i >= 18 || j >= 18) {
		pr_debug("%s() error: input_fs=0x%x, i=%u, output_fs=0x%x, j=%u\n",
			__func__, input_fs, i, output_fs, j);
	} else {
		u32 k = iir_coef_tbl_matrix[i][j];

		pr_debug("%s() input_fs=0x%x, output_fs=0x%x, i=%u, j=%u, k=%u\n",
			__func__, input_fs, output_fs, i, j, k);

		if (k >= NO_NEED)
			pr_debug("%s() warning: NO_NEED\n", __func__);
		else if (k == RATIOVER)
			pr_debug("%s() warning: up-sampling ratio exceeds 16\n",
			__func__);
		else if (k == INV_COEF)
			pr_debug("%s() warning: up-sampling ratio need gen coef\n",
			__func__);
		else {
			coef = iir_coef_tbl_list[k].coef;
			cnt = iir_coef_tbl_list[k].cnt;
		}
	}
	*count = cnt;
	return coef;
}

/********************* memory asrc *********************/
int afe_power_on_mem_asrc_brg(int on)
{
	static DEFINE_MUTEX(lock);
	static int status;

	mutex_lock(&lock);
	if (on != 0) {
		if (status == 0)
			afe_clear_bit(MASRC_TOP_CON, PDN_ASRC_BRG_POS);
		++status;
	} else {
		if (status > 0 && (status-1) == 0)
			afe_set_bit(MASRC_TOP_CON, PDN_ASRC_BRG_POS);
		status--;
	}
	mutex_unlock(&lock);

	return 0;
}

int afe_power_on_mem_asrc(enum afe_mem_asrc_id id, int on)
{
	int pos;

	if (unlikely(id >= ASRC_MAX_NUM)) {
		pr_debug("%s() error: invalid asrc[%d]\n", __func__, id);
		return -EINVAL;
	}
	if (on != 0) {
		pos = PDN_MEM_ASRC1_POS + (int)(id);
		afe_clear_bit(MASRC_TOP_CON, pos);
		/* force reset */
		pos = MEM_ASRC_1_RESET_POS + (int)(id);
		afe_set_bit(MASRC_ASM_CON2, pos);
		afe_clear_bit(MASRC_ASM_CON2, pos);
	} else {
		pos = PDN_MEM_ASRC1_POS + (int)(id);
		afe_set_bit(MASRC_TOP_CON, pos);
	}
	//dump whole register
	pr_debug("%s - MASRC_TOP_CON: 0x%08x  ...\n", __func__,
		afe_read_bits(MASRC_TOP_CON, 0, 32));
	pr_debug("%s - MASRC_ASM_CON2: 0x%08x  ...\n", __func__,
		afe_read_bits(MASRC_ASM_CON2, 0, 32));

	return 0;
}

u32 afe_mem_asrc_irq_status(enum afe_mem_asrc_id id)
{
	u32 addr = REG_ASRC_IFR + (u32)(id) * MASRC_OFFSET;

	return afe_read(addr);
}

void afe_mem_asrc_irq_clear(enum afe_mem_asrc_id id, u32 status)
{
	u32 addr = REG_ASRC_IFR + (u32)(id) * MASRC_OFFSET;

	afe_write(addr, status);
}

int afe_mem_asrc_irq_enable(enum afe_mem_asrc_id id, u32 interrupts, int en)
{
	u32 addr = REG_ASRC_IER + (u32)(id) * MASRC_OFFSET;
	u32 val = (en != 0) ? interrupts : 0U;

	afe_msk_write(addr, val, interrupts);

	return 0;
}

int afe_mem_asrc_irq_is_enabled(enum afe_mem_asrc_id id, u32 interrupt)
{
	u32 addr = REG_ASRC_IER + (u32)(id) * MASRC_OFFSET;

	return (((u32)afe_read(addr) & interrupt) != 0U) ? 1 : 0;
}

static enum afe_sampling_rate freq_to_fs(u32 freq)
{
	if (freq < (0x049800U + 0x050000U) / 2U)
		return FS_7350HZ;	/* 0x049800 */
	else if (freq < (0x050000U + 0x06E400U) / 2U)
		return FS_8000HZ;	/* 0x050000 */
	else if (freq < (0x06E400U + 0x078000U) / 2U)
		return FS_11025HZ;	/* 0x06E400 */
	else if (freq < (0x078000U + 0x093000U) / 2U)
		return FS_12000HZ;	/* 0x078000 */
	else if (freq < (0x093000U + 0x0A0000U) / 2U)
		return FS_14700HZ;	/* 0x093000 */
	else if (freq < (0x0A0000U + 0x0DC800U) / 2U)
		return FS_16000HZ;	/* 0x0A0000 */
	else if (freq < (0x0DC800U + 0x0F0000U) / 2U)
		return FS_22050HZ;	/* 0x0DC800 */
	else if (freq < (0x0F0000U + 0x126000U) / 2U)
		return FS_24000HZ;	/* 0x0F0000 */
	else if (freq < (0x126000U + 0x140000U) / 2U)
		return FS_29400HZ;	/* 0x126000 */
	else if (freq < (0x140000U + 0x1B9000U) / 2U)
		return FS_32000HZ;	/* 0x140000 */
	else if (freq < (0x1B9000U + 0x1E0000U) / 2U)
		return FS_44100HZ;	/* 0x1B9000 */
	else if (freq < (0x1E0000U + 0x372000U) / 2U)
		return FS_48000HZ;	/* 0x1E0000 */
	else if (freq < (0x372000u + 0x3C0000U) / 2U)
		return FS_88200HZ;	/* 0x372000 */
	else if (freq < (0x3C0000U + 0x6E4000U) / 2U)
		return FS_96000HZ;	/* 0x3C0000 */
	else if (freq < (0x6E4000U + 0x780000U) / 2U)
		return FS_176400HZ;	/* 0x6E4000 */
	else if (freq < (0x780000U + 0xDC8000U) / 2U)
		return FS_192000HZ;	/* 0x780000 */
	else if (freq < (0xDC8000U + 0xF00000U) / 2U)
		return FS_352800HZ;	/* 0xDC8000 */
	else
		return FS_384000HZ;	/* 0xF00000 */
}

static u32 cali_trx_src_mapping(
	enum afe_mem_asrc_tracking_source tracking_src)
{
	switch (tracking_src) {
	case MEM_ASRC_MULTI_IN:
	case MEM_ASRC_SPDIF_IN:
		return 0;
	case MEM_ASRC_PCMIF_SLAVE:
		return 1;
	case MEM_ASRC_ETDM_IN2_SLAVE:
		return 2;
	case MEM_ASRC_ETDM_IN1_SLAVE:
		return 3;
	default:
		break;
	}

	return 0;
}

int afe_mem_asrc_cali_setup(enum afe_mem_asrc_id id,
	enum afe_mem_asrc_tracking_mode tracking_mode,
	enum afe_mem_asrc_tracking_source tracking_src,
	u32 cali_cycle,
	u32 input_freq,
	u32 output_freq)
{
	int asrc_running;
	u32 cali_status, addr_offset, freq;
	u32 denominator = DENOMINATOR_48K;
	u32 tmp;
	enum afe_sampling_rate input_fs = freq_to_fs(input_freq);
	enum afe_sampling_rate output_fs = freq_to_fs(output_freq);

	addr_offset = (u32)(id) * MASRC_OFFSET;
	if (unlikely(id >= ASRC_MAX_NUM)) {
		pr_debug("%s() error: invalid asrc[%d]\n", __func__, id);
		return -EINVAL;
	}
